{"inkVersion":20,"root":[[{"->":"intro"},["done",{"#n":"g-0"}],null],"done",{"intro":[[{"#":"CLEAR"},{"#":"HEADER: img/profile.jpg"},{"#":"HR: simple"},"^<b><i><center>By understanding who we are, we can decide what requires our attention</center></i></b>","\n",{"#":"HR: simple"},"^Hi, I'm Mara!  I'm a 3rd year PhD student working with <a href=\"https:faculty.washington.edu/ajko/\">Amy J. Ko</a>.","\n","^Presently, my research interests are centered around career decisions made by students in computing, and what factors inform those decisions.","\n","^I'm most interested in career decisions made by computing students, or, why so many graduates from prestigious CS programs go to work at one of four companies. I promise, it's not just the money.","\n","^I hope that one day, more computing learners can find work that affirms their personhood, honors their narratives, and brings about collective liberation. Or, at least makes them happy -- lots of folks seem pretty unhappy.","\n","^I'm also working on integrating critical pedagogy into computer systems courses, sufacing students understandints of <i>how we got here</i>, instead of solely explaning how computer systems work.","\n","^I've dubbed myself a \"recovering computer architect\", I researched manycore compiler solutions with <a href=\"http:michaeltaylor.org/\">Micheal Taylor</a> and intermittent FPGAs and multithreading support with <a href=\"https:brandonlucia.com/\">Brandon Lucia</a>, before switching to computing education.","\n","^I get excited about a whole bunch of things: metacognition, queer theory, surveillance capitalism, political identity, the role of computing in society, and problem selection.","\n",{"#":"I'm working to change the narrative around computing (currently vying for the most ubiquitous trade) from \"something that software engineers do when they move fast and break things\" to \"a tool that can create profound societal change and must be used as a force for liberation\"."},"ev","str","^Publications","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"pubs"},{"#":"+ [Take a breath!]"},{"#":"-> breathe.prep"},null]}],null],"breathe":[{"->":".^.prep"},{"prep":[[{"#":"CLEAR"},"^We're just going to take a few breaths.","\n","^It's helpful to slow down a bit before introspection.","\n","^You can close your eyes if you'd like.","\n","^Ready?","\n","ev","str","^yup!","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"breathe.breath"},null]}],null],"breath":[{"#":"CLEAR"},"^Breathe in...      ",{"#":"DELAY: 4000"},"\n","^...and breathe out ",{"#":"DELAY: 4000"},"\n","^Breathe in...      ",{"#":"DELAY: 5000"},"\n","^...and breathe out ",{"#":"DELAY: 5000"},"\n","^Breathe in...      ",{"#":"DELAY: 5000"},"\n","^...and breathe out ",{"#":"DELAY: 5000"},"\n","ev",{"CNT?":".^.^.breath_suffix"},"!","out","/ev","^ ",{"->":".^.^.breath_suffix"},"\n","ev",{"CNT?":".^.^.breath_suffix"},"out","/ev","^ ",{"->":".^.^.choices"},"\n",null],"breath_suffix":["^You can continue at whatever pace feels good for you.","\n","^There's no need to rush through this.","\n","^Feel free to continue whenever you're ready.","\n",{"->":".^.^.choices"},{"#f":1}],"choices":[["ev","str","^I'd like a few more guided breaths","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I'd like to continue on","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"breathe.breath"},null],"c-1":["\n",{"->":"intro"},null]}],null]}],"pubs":[[{"#":"CLEAR"},"^I haven't published much, but stay tuned!","\n","^<a href=\"https:doi.org/10.1145/3424000\">It's time for more Critical CS Education</a>.  Amy J. Ko, Alannah Oleson, <b>Mara Kirdani-Ryan</b>, Yim Register, Benjamin Xie, Mina Tari, Matthew Davidson, Stefania Druga, and Dastyni Loksa. <i>Communications of the ACM</i>, 31–33. November 2020.","\n","ev","str","^Go back","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"intro"},null]}],null],"ending":["^You've reached the end! Thanks!","\n","end",null]}],"listDefs":{}}